---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.KeyBasedTreeEntryFailures
source: html/9a1d74ea-6aba-66b9-3d06-b4cdf1df3250.htm
---
# BuiltInFailures.KeyBasedTreeEntryFailures Properties

Level [Level] of Classification [Code] is not an integer from 1 to 5.